tutorials/multiphase/reactingMultiphaseEulerFoam/laminar/biomassPyrolsis/ranziDevolCRECK/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.air 1
    volScalarFieldValue alpha.particles1 0
    volScalarFieldValue alpha.particles2 0
    volScalarFieldValue CELL.particles2  0.442
    volScalarFieldValue XYHW.particles2  0.347
    volScalarFieldValue LIGC.particles2  0.036
    volScalarFieldValue LIGH.particles2  0.108
    volScalarFieldValue LIGO.particles2  0.067
    volScalarFieldValue CHAR.particles2 0
    //volScalarFieldValue gas.particles2  1.0
);

regions
(
    boxToCell
    {
        box (0 0 0) (1 0.10414 1);

        fieldValues
        (
            volScalarFieldValue alpha.air            0.4
            volScalarFieldValue alpha.particles1     0.6
        );
    }
);


// ************************************************************************* //
